# Pandas가 무엇인가요?
* 팬더스 데이터 프레임, 시리즈 알아보기

In [2]:
import pandas as pd

In [3]:
data_frame = pd.read_csv('data/housing.csv')

* tab을 누르면 사용할 수 있는 자동완성 리스트가 나온다.
* data_frame 은 2D array이다 excel과 상당히 유사
* pandas는 기본적으로 numpy를 사용한다. 퍼모먼스가 좋다.

In [6]:
data_frame.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY

* data_frame의 각 컬럼들이 Series 이다.
* 그래서 data_frame은 Series의 결합체이다.

In [7]:
list_tmp = [1,2,3]

In [8]:
list_tmp

[1, 2, 3]

In [9]:
s1 = pd.core.series.Series([1,2,3])

In [10]:
s2 = pd.core.series.Series(['one','two','three'])

In [12]:
# series 2개로 데이터 프레임 만들기
pd.DataFrame(data=dict(num=s1,word=s2)) 
# 숫자는 s1, word는 s2
# python 리스트로 시리즈 만들고
# series로 데이터프레임을 만들었다.
# 이건 라이브러리 안에서 실행된다.

   num   word
0    1    one
1    2    two
2    3  three

In [19]:
data_frame.tail(2) #뒤에서 두개

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
20638,-121.32,39.43,18.0,1860.0,409.0,741.0,349.0,1.8672,84700.0,INLAND
20639,-121.24,39.37,16.0,2785.0,616.0,1387.0,530.0,2.3886,89400.0,INLAND

In [ ]:
df = pd.read_csv('data/tab.csv',delimiter = '\t')
# 데이터가 탭으로 구분된 경우

In [ ]:
df = pd.read_csv('data/tab.csv',header = None)
# 데이터에 헤더가 없어요~

In [ ]:
df.columns = ['name','age','job']
# 헤더 정보를 넣어주기.

In [ ]:
df =pd.read_csv('data/no_header.csv', header= None , names =['name','age','job'])
# 한방에 넣을 수 있다.

# Create DataFrame from your python code

In [20]:
import pandas as pd

In [21]:
# dictionary를 가지고 있는 리스트 만들것이다.
friend_dict_list = [
    {'name':'John','age':25, 'job':'student'},
    {'name':'Nate','age':30, 'job':'teacher'}
]

In [22]:
df = pd.DataFrame(friend_dict_list)

In [23]:
df.head()
# 딕셔너리는 키값의 순서가 보장이 안된다.

   age      job  name
0   25  student  John
1   30  teacher  Nate

In [24]:
df = df[['name','age','job']]
# 컬럼의 순서를 변경해야하는 번거로움

In [25]:
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [26]:
from collections import OrderedDict

In [27]:
#키의 순서를 보장한다.
friend_ordered_dict = OrderedDict(
    [
        ('name',['john','nate']),
        ('age',[25,30]),
        ('job',['student','teacher'])
        
    ]
)

In [28]:
df = pd.DataFrame.from_dict(friend_ordered_dict)

In [29]:
df.head()

   name  age      job
0  john   25  student
1  nate   30  teacher

In [30]:
friend_list = [
    ['john',20,'student'],
    ['Nate',30,'teacher']
]

In [31]:
column_name = ['name','age','job']

In [32]:
df = pd.DataFrame.from_records(friend_list, columns = column_name)

In [33]:
df.head()

   name  age      job
0  john   20  student
1  Nate   30  teacher

In [34]:
# 한번에 만들어 보고싶다!

In [35]:
friend_list =[
    ['name',['John','Nate']],
    ['age',[20,30]],
    ['job',['student','teacher']]
]

In [36]:
df = pd.DataFrame.from_items(friend_list)

In [37]:
df.head()

   name  age      job
0  John   20  student
1  Nate   30  teacher

In [ ]:
# 이처럼 Dictionary와 list를 활용하면 DataFrame을 만들 수 있다.

# Write DataFrame to csv

In [3]:
friends = [{'name':'Jone', 'age':20,'job':'student'},
            {'name':'Jenny','age':30,'job':None},
          {'name':'Nate','age':30,'job':'teacher'}]
df = pd.DataFrame(friends)
df = df[['name','age','job']]

In [4]:
df.head()

    name  age      job
0   Jone   20  student
1  Jenny   30     None
2   Nate   30  teacher

You can create csv file using below command

In [5]:
df.to_csv('friend_list_from_df.csv')
# index 는 true , header = true 다 가 default로 설정되어있다.

Below is one example of dataframe doesn't have header

In [8]:
friend_list = [['John',20,'student'],['Jenny',30,'developer'],['Nate',30,'teacher']]
df = pd.DataFrame.from_records(friend_list)

In [9]:
df.head()

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

you can write csv file using below command

In [10]:
df.to_csv('friends_list_from_df.csv')

you also can write csv file using below command

In [11]:
df.to_csv('frien_list_from_df.txt')

by default, header and index are True like below, even if you don't mention itin the command

In [12]:
df.to_csv('friend_list_from_df.csv',header = True ,index =True)

header = False means you don't want to create column names. no 0, 1, 2 at column name
index = False means you don't want to create row names. no 0,1,2 at row name

In [13]:
df.to_csv('friend_list_from_df.csv',header = False , index = False)

In [15]:
friend_list = [
    ['name',['John',None,'nate']],
    ['age',[20,None,30]],
    ['job',['student','developer','teacher']]
    
]
df = pd.DataFrame.from_items(friend_list)

In [16]:
df.head()

   name   age        job
0  John  20.0    student
1  None   NaN  developer
2  nate  30.0    teacher

In [17]:
df.to_csv('friend_list_from_df.csv')

In [18]:
df.to_csv('friend_list_from_df.csv',na_rep='-')

# Select, Filter Rows or Columns

In [10]:
friend_list = [
    ['name',['John','Jenny','Nate']],
    ['age',[10,20,30]],
    ['job',['student','developer','teacher']]
]
df = pd.DataFrame.from_items(friend_list)

In [11]:
df

    name  age        job
0   John   10    student
1  Jenny   20  developer
2   Nate   30    teacher

인덱스 1번에서 2번까지의 행을 선택

In [12]:
df[1:3] # 파이썬은 기본적으로 인덱스를 주면 첫번째는 포함하고 마지막 인덱스는 포함하지 않는다.

    name  age        job
1  Jenny   20  developer
2   Nate   30    teacher

In [13]:
df.loc[[0,2]] # location 함수 여기에 원하는 row의 index를 넣어주면 된다.

   name  age      job
0  John   10  student
2  Nate   30  teacher

In [14]:
df.head()

    name  age        job
0   John   10    student
1  Jenny   20  developer
2   Nate   30    teacher

# by column condition

In [15]:
df_filtered = df[df.age > 25]

In [16]:
df_filtered

   name  age      job
2  Nate   30  teacher

In [21]:
df_filtered = df.query('age>=20')

In [22]:
df_filtered

    name  age        job
1  Jenny   20  developer
2   Nate   30    teacher

In [23]:
df_filtered = df[(df.age >25)& (df.name == 'Nate')]

In [24]:
df_filtered

   name  age      job
2  Nate   30  teacher

In [25]:
df

    name  age        job
0   John   10    student
1  Jenny   20  developer
2   Nate   30    teacher

# Filter Column
### by index

In [29]:
friend_list = [['John',20,'student'],['Jenny',30,'developer'],['Nate',30,'teacher']]
df = pd.DataFrame.from_records(friend_list)
# 데이터 프레임을 리스트로 만듬
#df = pd.DataFrame.from_records(데이터, columns = column_name) 이렇게 하면 컬럼name 지정해서 df 를 만들 수 있다.
df
# 컬럼도 인덱스가 있게 만듬 , row 인덱스도 일부러

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

select all rows, from column 0 to column 1

* 만약 Column 인덱스 0번과 1번만 필요하다면 어떨까 ,

In [31]:
# iloc 모든 로우를 원한다 하면 : (콜론) 하고 , 0:2  3개의 로우 0번 1번 컬럼
# , 컴마가 있고 앞부분 과 뒷부분  앞부분 로우 뒷부분 컬럼
#  로우,컬럼
df.iloc[:,0:2]

       0   1
0   John  20
1  Jenny  30
2   Nate  30

In [32]:
df.iloc[:,:]

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

## by column name

In [42]:
df = pd.read_csv('data/housing.csv')
#df = pd.read_csv('data/housing.csv',header= None , names = ['longitude','latitude'] )
df.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY

In [44]:
df_filtered = df[['longitude','latitude']]
df_filtered.head()

   longitude  latitude
0    -122.23     37.88
1    -122.22     37.86
2    -122.24     37.85
3    -122.25     37.85
4    -122.25     37.85

 이렇게 필터를 했고 다른 방법으로는 ?

In [46]:
df.filter(items=['longitude','latitude']).head()

   longitude  latitude
0    -122.23     37.88
1    -122.22     37.86
2    -122.24     37.85
3    -122.25     37.85
4    -122.25     37.85

In [48]:
df.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY

* Column name에 특정 키워드인것만 보고싶어

In [52]:
df.filter(like='hous', axis=1).head() # 축에서 컬럼은 항상 1

   housing_median_age  households  median_house_value
0                41.0       126.0            452600.0
1                21.0      1138.0            358500.0
2                52.0       177.0            352100.0
3                52.0       219.0            341300.0
4                52.0       259.0            342200.0

In [57]:
dfex1=df.filter(regex='s$',axis=1).head() # 정규식을 사용해서 s로 끝나는것만 확인하고 싶어
dfex1

   total_rooms  total_bedrooms  households
0        880.0           129.0       126.0
1       7099.0          1106.0      1138.0
2       1467.0           190.0       177.0
3       1274.0           235.0       219.0
4       1627.0           280.0       259.0

In [58]:
dfex1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
total_rooms       5 non-null float64
total_bedrooms    5 non-null float64
households        5 non-null float64
dtypes: float64(3)
memory usage: 200.0 bytes